-- 수영
INSERT INTO `GYM` (`name`, `address`, `longitude`, `latitude`, `phone`, `type`, `capacity`, `rating`)
VALUES
    ('웨이브워터 강남', '서울특별시 강남구 학동로 426(삼성동, 강남구청내 본관1층로비)', 127.0470598, 37.51796816, '010-1234-5678', '수영', 100, 4.5),
    ('블루워터 강남', '서울특별시 강남구 학동로20길 25(논현동)', 127.0285345, 37.5115038, '010-2345-6789', '수영', 80, 4.2),
    ('실버워터 강남', '서울특별시 강남구 강남대로 396(역삼동, 2호선 강남역1번,12번 출구 중간)', 127.0283079, 37.49816465, '010-3456-7890', '수영', 120, 4.7),
    ('액티브워터 강남', '서울특별시 강남구 테헤란로 538(역삼동, 지하1층 역무실앞)', 127.063073, 37.508862, '010-4567-8901', '수영', 90, 4.0),
    ('플라잉워터 강남', '서울특별시 강남구 도곡로77길 23(대치동)', 127.0578495, 37.49972974, '010-5678-9012', '수영', 110, 4.8),
    ('피쉬워터 역삼1동', '서울특별시 강남구 역삼로7길 16(역삼동, 역삼1동주민센터 1층 로비)', 127.0332838, 37.49537321, '010-6789-0123', '수영', 70, 4.3),
    ('디럭스워터 삼성', '서울특별시 강남구 봉은사로 616(삼성동)', 127.062501, 37.5143323, '010-7890-1234', '수영', 150, 4.6),
    ('미러워터 강남', '서울특별시 강남구 학동로 425(청담동)', 127.0469585, 37.51871603, '010-8901-2345', '수영', 85, 4.1),
    ('파워워터 일원', '서울특별시 강남구 일원로 81(일원동, 별관입구 수납창구 뒤)', 127.0895902, 37.49034451, '010-9012-3456', '수영', 95, 4.9),
    ('헬스워터 삼성2동', '서울특별시 강남구 봉은사로 419(삼성동)', 127.0459769, 37.51120727, '010-0123-4567', '수영', 130, 4.4);


-- 헬스
INSERT INTO `GYM` (`name`, `address`, `longitude`, `latitude`, `phone`, `type`, `capacity`, `rating`)
VALUES
    ('피트니스 강남센터', '서울특별시 강남구 테헤란로 114(역삼동)', 127.0301032, 37.49828846, '010-1234-5678', '헬스', 200, 4.6),
    ('스트롱헬스 강남', '서울특별시 강남구 광평로 301-4(수서동)', 127.1049911, 37.4889031, '010-2345-6789', '헬스', 150, 4.3),
    ('파워헬스 역삼', '서울특별시 강남구 역삼로7길 16(역삼동)', 127.0332838, 37.49537321, '010-3456-7890', '헬스', 180, 4.8),
    ('다이나믹헬스 대치', '서울특별시 강남구 도곡로77길 23(대치동)', 127.0578495, 37.49972974, '010-4567-8901', '헬스', 220, 4.5),
    ('스포티헬스 청담', '서울특별시 강남구 학동로 426(삼성동, 강남구청내 본관1층 로비)', 127.0470598, 37.51796816, '010-5678-9012', '헬스', 170, 4.2),
    ('엑티브헬스 삼성', '서울특별시 강남구 봉은사로 616(삼성동)', 127.062501, 37.5143323, '010-6789-0123', '헬스', 190, 4.7),
    ('히어로헬스 삼성2동', '서울특별시 강남구 봉은사로 419(삼성동)', 127.0459769, 37.51120727, '010-7890-1234', '헬스', 210, 4.4),
    ('플라잉헬스 청담', '서울특별시 강남구 학동로 426(삼성동, 강남구청내 본관 1층 로비)', 127.0470598, 37.51796816, '010-8901-2345', '헬스', 140, 4.9),
    ('스마트헬스 신사', '서울특별시 강남구 압구정로 172(압구정동, 지하1층4번출구)', 127.0281956, 37.52682814, '010-9012-3456', '헬스', 230, 4.1),
    ('챌린지헬스 세곡', '서울특별시 강남구 밤고개로 286, 세곡동주민센터 (율현동)', 127.1069125, 37.46904926, '010-0123-4567', '헬스', 160, 4.6);

-- 농구
INSERT INTO `GYM` (`name`, `address`, `longitude`, `latitude`, `phone`, `type`, `capacity`, `rating`)
VALUES
    ('슬램덩크 강남', '서울특별시 강남구 언주로 211(도곡동)', 127.0463104, 37.49280599, '010-1234-5678', '농구', 50, 4.2),
    ('핫숏 강남', '서울특별시 강남구 일원로 81(일원동, 별관입구 수납창구 뒤)', 127.0895902, 37.49034451, '010-2345-6789', '농구', 40, 4.7),
    ('프리썬 강남', '서울특별시 강남구 봉은사로 419(삼성동)', 127.0459769, 37.51120727, '010-3456-7890', '농구', 60, 4.4),
    ('플라이하이 역삼', '서울특별시 강남구 역삼로7길 16(역삼동)', 127.0332838, 37.49537321, '010-4567-8901', '농구', 45, 4.9),
    ('다이빙 대치', '서울특별시 강남구 도곡로77길 23(대치동)', 127.0578495, 37.49972974, '010-5678-9012', '농구', 55, 4.6),
    ('슈팅스타 율현', '서울특별시 강남구 밤고개로 286, 세곡동주민센터 (율현동)', 127.1069125, 37.46904926, '010-6789-0123', '농구', 35, 4.1),
    ('알레이유 역삼2동', '서울특별시 강남구 역삼로7길 16(역삼동)', 127.0332838, 37.49537321, '010-7890-1234', '농구', 65, 4.6),
    ('버킷리스트 개포', '서울특별시 강남구 개포로38길 12(개포동)', 127.0516585, 37.47881995, '010-8901-2345', '농구', 75, 4.5),
    ('스카이블루 청담', '서울특별시 강남구 학동로43길 17(논현동)', 127.0372042, 37.51728313, '010-9012-3456', '농구', 85, 4.3),
    ('플라잉워터 압구정', '서울특별시 강남구 압구정로33길 48(압구정동)', 127.0306522, 37.53061724, '010-0123-4567', '농구', 95, 4.8);

-- 필라테스
INSERT INTO `GYM` (`name`, `address`, `longitude`, `latitude`, `phone`, `type`, `capacity`, `rating`)
VALUES
    ('플라잉필라테스 강남점', '서울특별시 강남구 테헤란로 156(역삼동, 역삼역 지하1층 5번출구)', 127.0366182, 37.50071627, '010-2345-6789', '필라테스', 30, 4.2),
    ('스피닝스튜디오', '서울특별시 강남구 테헤란로 340(삼성동, 선릉역 지하 3번출구)', 127.0489425, 37.50450288, '010-3456-7890', '필라테스', 25, 4.7),
    ('Air Pilates Studio', '서울특별시 강남구 테헤란로 114(역삼동)', 127.0301032, 37.49828846, '010-4567-8901', '필라테스', 20, 4.0),
    ('래나필라테스', '서울특별시 강남구 학동로20길 25(논현동)', 127.0285345, 37.5115038, '010-5678-9012', '필라테스', 35, 4.5),
    ('스마일필라테스클럽', '서울특별시 강남구 언주로 211(도곡동)', 127.0463104, 37.49280599, '010-6789-0123', '필라테스', 40, 4.1);

-- 클라이밍
INSERT INTO `GYM` (`name`, `address`, `longitude`, `latitude`, `phone`, `type`, `capacity`, `rating`)
VALUES
    ('서울 클라이밍 센터', '서울특별시 강남구 역삼로7길 16(역삼동)', 127.0332838, 37.49537321, '010-7890-1234', '클라이밍', 20, 4.2),
    ('강남 클라이밍 센터', '서울특별시 강남구 압구정로 172(압구정동)', 127.0281956, 37.52682814, '010-8901-2345', '클라이밍', 15, 4.7),
    ('클라이밍 스튜디오', '서울특별시 강남구 논현로 566, 강남차병원 (역삼동)', 127.0347144, 37.50703244, '010-9012-3456', '클라이밍', 25, 4.0),
    ('강남클라이밍센터', '서울특별시 강남구 선릉로 668, 강남구보건소,강남구립국제교육원 (삼성동)', 127.0423035, 37.51631743, '010-0123-4567', '클라이밍', 30, 4.5),
    ('강남클라이밍클럽', '서울특별시 강남구 영동대로65길 24, 대치2동주민센터 (대치동)', 127.0641877, 37.50230433, '010-1234-5678', '클라이밍', 18, 4.1);

-- 복싱
INSERT INTO `GYM` (`name`, `address`, `longitude`, `latitude`, `phone`, `type`, `capacity`, `rating`)
VALUES
    ('강남복싱클럽', '서울특별시 강남구 학동로 426(삼성동, 강남구청내 본관 1층 로비)', 127.0470598, 37.51796816, '010-2345-6789', '복싱', 50, 4.2),
    ('복싱 피트니스', '서울특별시 강남구 역삼로7길 16(역삼동)', 127.0332838, 37.49537321, '010-3456-7890', '복싱', 40, 4.7),
    ('싸이클링클럽', '서울특별시 강남구 도곡로77길 23, 대치4동주민센터 (대치동)', 127.0578495, 37.49972974, '010-4567-8901', '복싱', 60, 4.0),
    ('남성복싱', '서울특별시 강남구 일원로 81(일원동, 별관입구 수납창구 뒤)', 127.0895902, 37.49034451, '010-5678-9012', '복싱', 45, 4.5),
    ('여성복싱', '서울특별시 강남구 봉은사로 419(삼성동)', 127.0459769, 37.51120727, '010-6789-0123', '복싱', 55, 4.1);

-- 배드민턴
INSERT INTO `GYM` (`name`, `address`, `longitude`, `latitude`, `phone`, `type`, `capacity`, `rating`)
VALUES
    ('강남배드민턴클럽', '서울특별시 강남구 역삼로7길 16(역삼동)', 127.0332838, 37.49537321, '010-7890-1234', '배드민턴', 30, 4.2),
    ('배드민턴 피트니스', '서울특별시 강남구 테헤란로 340(삼성동, 선릉역 지하 3번출구)', 127.0489425, 37.50450288, '010-8901-2345', '배드민턴', 25, 4.7);